app/controllers/categories_controller.rb

INSERT INTO `categories` (`description`, `created_at`, `updated_at`) VALUES ('', '2011-07-14 00:22:06', '2011-07-14 00:22:06')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
UPDATE `categories` SET `description` = 'Clocks', `updated_at` = '2011-07-14 00:22:53' WHERE `categories`.`id` = 2
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])