app/controllers/products_controller.rb

  def index

    @products   = Product.all
    @categories = Category.all

    # Filter
    if params[:active] == 'true'
      @products = Product.where :active => true
---
SELECT `products`.* FROM `products`
SELECT `categories`.* FROM `categories`
SELECT `products`.* FROM `products` WHERE `products`.`active` IS NULL

  def create
    @product = Product.new(params[:product])
    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `description`, `price`, `created_at`, `updated_at`, `active`) VALUES ('The Rails Way 2nd Edition', 'the best book of rails', 45.9, '2011-07-13 01:03:24', '2011-07-13 01:03:24', 1)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `category_id` = 1, `active` = 1, `updated_at` = '2011-07-13 22:59:10' WHERE `products`.`id` = 2

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 6