app/views/categories/show.html.slim

SELECT COUNT(*) FROM `products` WHERE (`products`.category_id = 1)
---
p
  h2="#{@category.description} (#{@category.products.count})"