app/views/products/index.html.slim

SELECT `categories`.* FROM `categories`
---
  = form_tag('/products', :method => "GET", :id => "category") do
    = select_tag :category, options_for_select(@categories.collect {|c| [c.description, c.id]}), :include_blank => "Category"