app/views/products/show.html.slim


- unless @product.category.blank?
---
SELECT `categories`.* FROM `categories`